alacritty
atuin
base-devel
bat
cifs-utils
curl
distrobox
docker
docker-compose
fd
flatpak
fzf
ghostty
git
go
helm
jq
k9s
keepassxc
kubectl
lazygit
luarocks
neovim
restic
ripgrep
snap-pac
snapper
stow
task
tmux
tree
uv
vlc
wget
yazi
yq
zellij
zsh

# --- new tools: evaluate and remove if unwanted ---
eza          # ls replacement with git status and Nerd Font icons
glow         # markdown reader in the terminal
zoxide       # frecency-based cd replacement; pairs with fzf
